snlkuharlocal/src/InformationRegisters/СтатусыПроверкиКМвЧЗ/СтатусыПроверкиКМвЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПроверкиКМвЧЗ</name>
  <resources>
    <name>Результат</name>
    <type>
      <types>EnumRef.СтатусПроверкиКМвЧЗ</types>
    </type>
  </resources>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыПроверкиКМвЧЗ/ManagerModule.bsl
Функция СтатусПроверкиДокументаПоЧЗ(Документ) Экспорт
	Результат = Неопределено;
	
	МЗ = РегистрыСведений.СтатусыПроверкиКМвЧЗ.СоздатьМенеджерЗаписи();
	МЗ.Документ = Документ;	
	МЗ.Прочитать();        
	
	Если МЗ.Документ = Документ  Тогда
		Результат = МЗ.Результат;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //СтатусПроверкиДокументаПоЧЗ(Документ) Экспорт

Процедура УстановитьРезультатПроверкиДокументаПоЧЗ(Документ, Результат, ДопПараметры = Неопределено) Экспорт
	МЗ = РегистрыСведений.СтатусыПроверкиКМвЧЗ.СоздатьМенеджерЗаписи();
	
	МЗ.Документ 	= Документ;	
	МЗ.Результат	= Результат;
	
	МЗ.Автор 		= ПараметрыСеанса.Пользователь;
	МЗ.ДатаЗаписи   = ТекущаяДата();
	МЗ.ДопИнфо		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ДопИнфо");
	
	МЗ.Записать();	
КонецПроцедуры

Процедура УдалитьРезультатПроверкиДокументаПоЧЗ(Документ) Экспорт
	МЗ = РегистрыСведений.СтатусыПроверкиКМвЧЗ.СоздатьМенеджерЗаписи();
	
	МЗ.Документ = Документ;		
	
	МЗ.Удалить();
КонецПроцедуры
